sugarcrm-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/sugarcrm/setNoteAttachment.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sug="wso2.connector.sugarcrm.setnoteattachment">
   <soapenv:Header/>
   <soapenv:Body>
   <sug:sugarCRMApiUrl>https://ypbvhe6054.trial.sugarcrm.com/soap.php</sug:sugarCRMApiUrl>
        <sug:session>be0mc58ko3mcjhcfbj3jqasi16</sug:session>
       	<sug:noteId>1</sug:noteId>
      	<sug:fileName>sugarTestFileToBinary.txt</sug:fileName>
      	<sug:fileContent>0000-0010:  54 65 73 74-20 46 69 6c-65 20 48 65-72 65 2e 20  Test.Fil e.Here..
0000-0020:  50 6c 65 61-73 65 20 63-6f 6e 76 65-72 74 20 6d  Please.c onvert.m
0000-002c:  65 20 74 6f-20 62 69 6e-61 72 79 2e              e.to.bin ary.</sug:fileContent>
   </soapenv:Body>
</soapenv:Envelope>